import { NextResponse } from 'next/server';

export const DUMMY_DATA = {
    classes: ['9Д', '9Б', '9В', '9Г', '10Б'],
    // Assign teachers to classes. Key = ClassName, Value = TeacherCode
    // TEACH01 -> 9A, 9B; TEACH02 -> 9C; TEACH03 -> 9D (Example)
    teacherAssignments: {
        '9Д': 'TEACH02',
        '9Б': 'TEACH01',
        '9В': 'TEACH01',
        '9Г': 'ARIUNBOLD.G',
        '10Б': 'ARIUNBOLD.G',
    },
    // Mock students
    students: {
        '9Д': ['М.Амингоо', 'Т.Ариунзул', 'А.Баянжаргал', 'А.Билгүүн', 'Бодь-Эрдэнэ', 'П.Бум-Эрдэнэ', 'С.Дэнзэнцэрэн', 'Б.Жаргал', 'Б.Маргад-Эрдэнэ', 'М.Номgon', 'Н.Номтогс', 'Б.Одгэрэл', 'Ц.Одончимэг', 'Т.Оргил', 'Д.Тайван', 'Э.Тэмүгэ', 'Ч.Төгс-Оюут', 'Э.Төгслхам', 'М.Төгөлдөр', 'Р.Удвал', 'О.Хангал', 'Г.Хүслэн', 'Б.Цэлмүүн', 'Бя.Цэлмүүн', 'А.Энх-Амар', 'О.Энэрэлноров', 'Д.Эрмүүн', 'Б.Эрхнаран'],
        '9Б': ['С.Алтангэрэл', 'Т.Ананд', 'Ж.Гангэрэл', 'Б.Гэгээлэн', 'Д.Гэрэлгоо', 'Д.Дарьцэцэг', 'Д.Идэржавхлан', 'З.Ирмүүн', 'Э.Мандахнаран', 'Г.Маралжин', 'Д.Тэмүтөр', 'М.Түмэнжаргал', 'Г.Төгөлдөр', 'Г.Цэлмэг', 'Б.Энхмандах', 'Р.Үүрийнгэгээ', 'Э.Номуун', 'Тэнүүнгүн', 'Чоймаа', 'Цогт-Очир'],
        '9В': ['Б.Одбилэг', 'Б.Алтаргана', 'Ө.Баттүвшин', 'Д.Булгантамир', 'А.Ерназар', 'А.Мандахнаран', 'Ц.Манлайбаатар', 'Б.Марал', 'Б.Мөнхжин', 'Б.Намуун', 'Ц.Нарангоо', 'Н.Очир', 'Б.Сондор', 'О.Сэнгүнбилэг', 'Т.Сүбээдэй', 'Б.Сүлдхийморь', 'А.Тэмүүжин', 'Б.Түвшинбадрах', 'З.Түшиг', 'Т.Төрболд', 'Б.Удвал', 'А.Эгшиглэн', 'Б.Эрдэмбилэг', 'Г.Эрдэнэсүх'],
        '9Г': [
            'Алтантүрүү', 'Анир', 'Анужин', 'Анузаяа', 'Батмөнх', 'Бүжинлхам',
            'Есөн', 'Ивээлт', 'Мишээл', 'Мөнх-Од', 'Мөнх-Эрдэнэ', 'Мөнхтулга',
            'Наранбаатар', 'Саранцацрал', 'Содномдорж', 'Суубилгүүн', 'Тамир',
            'Тэргэл', 'Түвшинбилэг', 'Ургахнаран', 'Хангарьд', 'Чинхүслэн',
            'Энхзаяа', 'Энхмөнх', 'М.Энэрэл', 'Эрхэс', 'Үржинтэлмүүн',
            'Бямбацог', 'Энэрэл', 'Бадмаараг'
        ],
        '10Б': [
            "Билгүүнбаяр", "Мөнгөнтуул", "Майдар", "Амирлан", "Батболд", "Ундрам", "Ванчинсүрэн", "Маралмаа", "Эгшиглэн", "Жавхлан", "Цэнгүүн", "Гарьдмагнай", "Хан-Очир", "Удвалчимэг", "Наранзүг", "Эрдэмбаяр", "Эрдэнэсайхан", "Тэнгис", "Анирлан", "Биндэръяа", "Анар", "Агарбат", "Тэмүгэ", "Буянтогтох", "Гэгээнээ", "Оюунболор", "Мөнхтэмүүлэн", "Өгөөмөр", "Ариунбат", "Цэлмүүн", "Khasar", "Дөл", "Мөнгөн", "Гэгээ", "Нандинзүрх"
        ]
    }
};

export async function GET() {
    return NextResponse.json(DUMMY_DATA);
}
