import { NextResponse } from 'next/server';

export async function GET() {
    const teachers = [
        "Т.Анужин", "Т.Анхзул", "Г.Ариунболд", "А.Ариунтуяа", "З.Ариунтуяа",
        "Б.Аюурзана", "Р.Бадмаараг", "Б.Балжинням", "Б.Батцэцэг", "Д.Баяржаргал",
        "Ц.Булган", "М.Булганчимэг", "Б.Буяндэлгэр", "Ц.Буянжаргал", "Г.Бямбажаргал",
        "Л.Гантуяа", "Т.Даариймаа", "Л.Дэлгэрмаа", "Д.Итгэлмаа", "З.Лхамжав",
        "Б.Магсар", "С.Мөнхжаргал", "Ш.Нансалмаа", "О.Нарантуяа", "А.Номин-Эрдэнэ",
        "Б.Нямсүрэн", "Б.Одончимэг", "Р.Оргил", "Ц.Оргил-Эрдэнэ", "П.Отгонжаргал",
        "Б.Отгонжаргал", "Б.Отгонцэцэг", "А.Оюундарь", "Г.Пүрэвдаш", "П.Пүрэвдорж",
        "Ч.Пүрэвсүрэн", "И.Сансартуяа", "Ш.Сарангэрэл", "Ж.Сэлэнгэ", "Б.Сүхбат",
        "Б.Уянга", "Э.Хишигт", "Ц.Цэнгэл", "О.Янжиндулам", "Э.Өлзийсайхан",
        "Э. Анхбаяр", "Э.Долгорсүрэн", "Г.Мөнхцэцэг", "Н.Сувдмаа", "Б.Цэвэлмаа",
        "Д.Энхзул", "Б.Цогтбаатар", "Цэнд-Аюуш", "Ичинхорлоо", "Я.Янжиндулам"
    ];

    return NextResponse.json({ teachers });
}
